<template>
  <div class="productsList-box">
    <el-input
      placeholder="请输入内容"
      prefix-icon="el-icon-search"
      v-model="input"
    >
    </el-input>
    <div class="list">
      <div
        v-for="(product, index) in productsList"
        :key="index"
        class="product"
      >
        <div class="row1">
          <div
            class="pro-img"
            :style="`background-image: url(${product.img});`"
          ></div>
          <div class="row1-right">
            <div>{{ product.title }}</div>
            <div>价格：{{ product.price }}</div>
            <div>
              <el-button type="primary">加入购物车</el-button>
            </div>
          </div>
        </div>
        <el-collapse>
          <el-collapse-item title="直播总结">
            <div>
              {{ product.liveSummary }}
            </div>
          </el-collapse-item>
          <el-collapse-item title="卖点">
            <div>
              {{ product.sellingPoint }}
            </div>
          </el-collapse-item>
          <el-collapse-item title="问题">
            <div v-html="product.questions"></div>
          </el-collapse-item>
        </el-collapse>
        <!-- <div class="row2">
          <div>直播总结： {{ product.liveSummary }}</div>
          <div>卖点： {{ product.sellingPoint }}</div>
          <div>问题： {{ product.questions }}</div>
        </div> -->
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "ProductsList",
  props: {},
  data() {
    return {
      input: "",
      // activeNames: ['1'],
      productsList: [
        {
          title: "华凌（家用空调）KFR-72LW/N8HA1",
          price: 3999,
          img: require(`@/imgs/a.jpg`),
          liveSummary: "亲爱的家人们，欢迎来到今天的直播间！我是你们的主播小美，今天我要给大家带来一款超级棒的空调，华凌 KFR-72LW-N8HA1 ！咱们先来说说它的强大功能。它的遥控器按键设计得特别贴心，就说这个开关键，轻轻一按，空调就能开关，还能一键清除您之前设定的定时、自清洁等功能，方便得不得了！还有这个 eco 键，在制冷模式下按一下，它就进入 eco 节能模式啦，8 小时后自动退出。比如说您晚上睡觉开着，一晚上都能省电，而且还不影响您的舒适睡眠。模式键能让您轻松选择自动、制冷、抽湿、制热、送风这几种模式。风速键更是神奇，您可以粗调风速，有多种选择，而且在制冷、制热模式下，风速调到 100%，它会自动开启强劲功能，让您迅速感受到凉爽或温暖。再看调整键，在特定模式下能调整温度，范围在 16 到 30℃，递增递减非常灵活。左右风键能控制导风板自动摇摆，想让风往哪儿吹就往哪儿吹。还有智控温功能，通过遥控器或者美居 APP 就能开启，它会根据室内温度自动调节运行温度和风速，是不是特别智能？制冷或抽湿模式下关机后，干燥功能能防止机器下次开机有异味。舒睡功能在自动、制冷或制热模式下都能开启，前两小时每隔一小时调整一次设定温度，两小时后温度保持不变，8 小时后自动退出，让您睡个安稳觉。自清洁功能更是一绝，通过遥控器或美居 APP 开启后，室内机显示屏显示“CL”，运行 20 - 130 分钟后自动退出，运行过程中就算有冷风、热风或者异响，您都别担心，这都是正常现象。而且它还有自动开关门功能，能有效防止灰尘进入机器内部，延长空调的使用寿命。再看看它的联网功能，您只需要下载“美的美居”APP，按照简单的步骤注册登录，扫描机身二维码或者选择品类型号，就能轻松联网控制啦！说到参数，这可是大 3P 的空调，制冷功率 1970(300 - 3050)，制热功率 2950(260 - 3950) + 2300（电辅热），能效等级 1 级，APF 达到 4.39，节能效果杠杠的！制冷适用面积 32 - 48㎡，制热适用面积 36 - 49㎡，不管您的房间大小，它都能轻松应对。家人们，华凌 KFR-72LW-N8HA1 空调，功能强大，品质卓越，价格还美丽！赶快下单，把舒适带回家！",
          sellingPoint:
            "华凌 KFR-72LW-N8HA1 空调，您的理想之选！大 3 匹，适用面积 32 - 48㎡（制冷）、36 - 49㎡（制热）。1 级新能效，全直流变频，节能又环保。制冷功率 1970(300 - 3050)W，制热功率 2950(260 - 3950)+2300（电辅热）W，强劲冷暖。具备 eco 节能模式、智控温功能，还有干燥、舒睡、自清洁等实用功能。遥控器和控制面板操作便捷，可通过美的美居 APP 实现智能控制。使用环境温度范围广，-32℃ - 60℃ 均可正常运行。极地白外观，简约时尚，落地式安装，为您的家增添魅力！",
          questions: "制冷效果：KFR-72LW-N8HA1型号空调的额定制冷量为7210W，制冷功率为1970W。在制冷模式下，它可以快速降低室内温度，提供舒适的冷却环境。<br>能效等级：该空调的全年能源消耗效率APF（GB21455-2019）为4.39，能效等级为1级，属于高效节能的空调设备。<br>售后服务：购买华凌系列空调的用户，按规定办理了保修手续后，可以享受整机包修六年的保修政策。若出现非人为原因造成的故障，可以通过华凌空调客户服务部的服务热线或微信进行预约上门服务。",
        },
        {
          title: "美的（家用空调）KFR-26GW-N8KS1-1",
          price: 3999,
          img: require(`@/imgs/b.jpg`),

          liveSummary: "大家好，欢迎来到我们的直播间！今天要给大家介绍一款超级省电、超级智能的空调——美的大一匹酷省电空调，型号是KFR-26GW-N8KS1-1。听名字就知道，这款空调不仅酷，还特别省电哦！首先，这款空调支持连接小美音响、小度音响、天猫精灵和华为音响，简直是智能家居的好搭档！你可以用语音控制它，懒人福音有没有？再来看看它的能效等级，一级能效！这可是空调界的“学霸”啊，制冷一小时耗电大约是0.24度，制热一小时大约是0.47度，开电辅热制热一小时大约是1.32度。省电省到你怀疑人生！它的制冷量是2650W，制热量是4550W，适用面积在11-17平方米之间，完全可以满足小卧室的需求。噪音方面，室内机最低只有18分贝，最高也不过40分贝，安静得让你怀疑它是不是在工作。这款空调还有很多贴心的小功能，比如防直吹、第四代智清洁、智控温、冷媒泄漏保护功能、WIFI+蓝牙、电量查询、忘关机提醒和滤网清洗提醒。简直是贴心小棉袄！最后，这款空调的外观也是相当时尚，极地白的颜色，简约大气，适合各种家居风格。机身尺寸是885×308×211mm，安装也非常方便。总之，这款美的大一匹酷省电空调，集智能、节能、静音、时尚于一身，绝对是你夏天和冬天的好伙伴！心动不如行动，赶紧下单吧！",
          sellingPoint: "KFR-26GW-N8KS1-1空调，大1匹壁挂式，具有多项出色功能。省电新升级，全天候节能运行，还可查询电量。拥有第四代智清洁、忘关机提醒等贴心功能。支持APP智能控制，操作便捷。制冷适用面积11 - 17㎡，制热适用面积13 - 17㎡。1级能效，全直流变频，节能环保。配有遥控器，按键功能丰富，包括酷省电、防直吹、智清洁等模式。",
          questions: "空调适用房间大小：美的KFR-26GW-N8KS1-1型号空调适用的房间面积为11-17平方米。<br>能效比：该空调的全年能源消耗效率APF为5.3，属于一级能效产品，具有高效节能的特性。<br>售后服务和保修期：购买此款空调并按规定办理保修手续的用户，可享受整机包修六年的服务。售后服务热线为400-8899-315，可预约上门服务。",
        },
        {
          title: "小天鹅（滚筒洗衣机）TD120V618T",
          price: 1980,
          img: require(`@/imgs/c.jpg`),

          liveSummary: "家人们，今天给大家带来一款超厉害的小天鹅洗衣机，让洗衣变得轻松又有趣！首先，咱们来看看电源开关，长按它就能轻松开关洗衣机，开机还有提示音，功能键全部亮起就进入待机状态，简单明了！启动/暂停键也超实用，如果洗衣机正在运行，按一下就暂停，长按 3 秒还能中途添衣。等待内筒停止旋转，门锁解锁听到“pa”的声音，就能安全添加衣物啦，然后再按下启动/暂停，继续洗刷刷！洗涤、漂洗、脱水、温度、转速这些功能，连续轻触就能调节，满足您各种洗衣需求。再说烘干功能，那可真是太棒啦！带烘干的程序能叠加烘干，有不同的烘干档位和时间选择。比如 AU 自动低温烘干，适合棉麻、化纤类衣物，低温呵护，丝绸、羊毛、羽绒服也能烘，不过要注意衣物重量哦。AUH 自动高温烘干，适合棉麻、化纤类衣物快速烘干。还有 30 定时烘干，根据衣物多少选择，方便得很！预约功能也很贴心，选好程序调好参数，轻触预约按键，就能选时间，到点自动开洗。特色功能更是让人惊喜！断电记忆，停电也不怕，来电继续洗。筒灯待机常亮，运行后按按键也能点亮，方便查看。水魔方功能，产生大量超微泡沫，洗衣效果杠杠的！程序方面也多种多样：混合洗，各种常见衣物都能搞定。冷水洗，护色护型又省电。节能洗，脏污一般的白色棉质衣物轻松洗净还节能。除螨洗，床上用品深层除螨杀菌。蒸汽消毒洗，持续高温消毒。漂+脱、筒自洁、单脱水、空气洗、单烘干、羊毛洗、羽绒服洗、速洗 30'、快洗 15，总有一款适合您！家人们，这么优秀的小天鹅洗衣机，还不赶紧带回家，让洗衣不再烦恼，生活更加轻松愉快！比如说，您要是经常有需要快速洗的小衣物，速洗 30'和快洗 15 就能派上用场；要是担心衣物变形，羊毛洗和羽绒服洗绝对能给您贴心呵护；要是想给衣物消毒，蒸汽消毒洗和除螨洗就是绝佳选择。这么多实用的功能，小天鹅洗衣机就是您的洗衣好帮手，别犹豫啦！",
          sellingPoint: "小天鹅洗衣机，功能卓越，贴心守护多种洗涤程序满足您的多样需求：* 混合洗，多种织物一网打尽。* 冷水洗，护色护型又省电。特色功能出众：* 断电记忆，停电无忧。* 水魔方，高效洗净。还有筒自洁保持卫生，空气洗祛味清新。多种烘干模式，满足不同衣物需求。选择华凌洗衣机，让洗衣变得轻松便捷！",
          questions: "1.洗衣机功能：华凌洗衣机TD120V618T具备多种功能，包括洗涤、漂洗、脱水、温度调节、转速调节、烘干、预约等。特色功能包括断电记忆、筒灯、水魔方等。此外，还有多种洗涤程序供用户选择，如混合洗、冷水洗、节能、除螨洗、蒸汽消毒洗等。<br>2.优惠活动：目前购买华凌洗衣机TD120V618T可享受200元安装优惠。<br>3.购买服务：购买华凌洗衣机TD120V618T后，用户可享受整机免费包修三年的服务。对于非家庭使用的洗衣机，用户凭发票及包修凭证享有整机免费包修三个月，主要零部件（如电机、电脑板、排水泵等）免费包修1年的服务。",
        },
        {
          title: "美的（冰箱）BCD-423WUFGPZM€",
          price: 2980,
          img: require(`@/imgs/d.jpg`),

          liveSummary: "嘿，朋友们！当您新拿到咱家这美的冰箱，初次通电那一瞬间，显示屏就会亮起来，默认设置冷藏室 5℃，冷冻室 -20℃，变温空间是母婴模式哦！而且要是 20 秒您没操作，显示屏就乖乖息屏锁定啦。说到这解锁锁定，也超简单！锁定状态下，您就持续按住【解锁/锁定】按键 3 秒钟，“滴”一声，解锁成功！反过来，非锁定状态下同样操作 3 秒，又锁定啦，是不是特方便？再来看看温度设定。触摸【温区选择】按键，冷藏、冷冻温区显示屏就像跳格子一样循环显示。解锁后，选中温区就能通过【温度调节】按键来调整温度。冷藏室 2℃ - 8℃随您定，冷冻室 -23℃ - -15℃任您选，息屏后设定就生效。要是您想关闭或开启冷藏室，也不难！当温区选择为冷藏室显示时，长按【温区选择】按键 10 秒钟就行。关闭时数码窗显示“--”，再长按 10 秒又能恢复。还有这速冷速冻模式，按【速冷/速冻】按键，“速冷”“速冻”“速冷+速冻”或者无，循环切换。速冷模式让冷藏室快速达到 2℃保鲜，最长 150 分钟自动退出。速冻模式下压缩机不停转，最长 24 小时或者冷冻室温度到 -28℃及以下自动退出。变温空间抽屉更厉害啦！母婴、零度、软冻三档可调，银离子还能抑菌。母婴模式 4℃适合存母乳鲜奶，零度模式 0℃适合短期海鲜水产，软冻模式 -4℃适合短期肉类。调湿空间抽屉也很贴心，高湿适合西兰花、绿叶蔬菜，低湿适合香菇、茶叶。冷冻空间抽屉能长时间保鲜，存肉类、鱼虾、水饺汤圆都没问题，大块肉记得分割成小块，方便取用哦！内置净味模块，吸附分解异味，抗菌超厉害！要是冰箱门开太久，超过 2 分钟就会报警，蜂鸣器响个不停。同时长按【温区选择】键、【变温】键 3 秒，能开关开门提示音。还有哦，咱家这冰箱有断电记忆功能，断电再上电，还是按照之前设定工作，超省心！朋友们，这么棒的美的冰箱，还不赶紧带回家！",
          sellingPoint: "美的冰箱，亮点多多！初次通电默认设置合理。解锁锁定便捷，操作简单。冷藏冷冻温度可调，范围广。冷藏能关闭开启。速冷速冻模式保鲜出色。变温空间三档可调，抑制细菌。调湿抽屉分高湿低湿。冷冻空间长期保鲜，存物多样。内置净味模块，抗菌除味。开门超 2 分钟报警，还有断电记忆功能。省心又好用，快把它带回家！",
          questions: "功能性能：BCD-423WUFGPZM(E)冰箱具有初始设定温度，解锁/锁定，冷藏/冷冻温度设定，速冷/速冻模式设定，变温空间抽屉模式设定，调湿空间抽屉，冷冻空间抽屉，净味模块，开门报警及开门提示音，断电记忆等功能。<br>售后服务：冰箱、冷柜、酒柜首次安装免费（不含优惠品、工程机）；不收取远程上门费及安装维修费；包括拆冰箱门入户，调试等服务。<br>外观设计：冰箱尺寸为宽759mm x 深600mm x 高1912mm，需预留足够空间，顶部、两侧需预留大于5mm的距离。设计时考虑到用户的便利性，易于清洁和保养，部件易于拆卸和安装。",
        },
      ],
    };
  },
  computed: {},
  mounted() {},
  methods: {},
};
</script>

<style scoped lang="scss">
.productsList-box {
  position: absolute;
  bottom: 0;
  left: 0;
  width: 100%;
  padding: 20px;
  box-sizing: border-box;
  border-radius: 20px 20px 0 0;
  background-color: #f3f6f8;
  z-index: 99;
  ::v-deep .el-input__icon {
    color: #c0c4cc;
  }
  .list {
    height: 600px;
    margin-top: 10px;
    overflow-y: auto; /* 垂直方向自动滚动 */
    overflow-x: hidden; /* 水平方向隐藏滚动条 */
    .product {
      background-color: #fff;
      width: 100%;
      margin-bottom: 12px;
      border-radius: 10px;
      padding: 10px;
      box-sizing: border-box;
      .row1 {
        display: flex;
        justify-content: space-between;
        .pro-img {
          width: 220px;
          height: 120px;
          border-radius: 10px;
          background-size: cover;
          background-position: center;
          background-repeat: no-repeat;
        }
        .row1-right {
          display: flex;
          flex-direction: column;
          justify-content: space-around;
          margin-left: 12px;
        }
      }
      div {
        color: black;
      }
    }
  }
}
</style>
